<!doctype html>



  


<html class="theme-next muse use-motion" lang="en">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Hexo, NexT" />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.1.0" />






<meta name="description" content="&amp;#xFF08;&amp;#x8BF4;&amp;#x660E;&amp;#xFF1A;&amp;#x672C;&amp;#x6587;&amp;#x539F;&amp;#x8F7D;2016&amp;#x5E74;&amp;#x7B2C;24&amp;#x671F;&amp;#x300A;&amp;#x8D22;&amp;#x65B0;&amp;#x5468;&amp;#x520A;&amp;#x300B;&amp;#xFF09; 
&amp;#x6211;&amp;#x5728;&amp;#x676D;&amp;#x5DDE;&amp;#x5DE5;&amp;#x4F5C;">
<meta property="og:type" content="article">
<meta property="og:title" content="你的命运不是一头骡子">
<meta property="og:url" content="http://yoursite.com/2016/09/29/你的命运不是一头骡子/index.html">
<meta property="og:site_name" content="梁小新blog">
<meta property="og:description" content="&amp;#xFF08;&amp;#x8BF4;&amp;#x660E;&amp;#xFF1A;&amp;#x672C;&amp;#x6587;&amp;#x539F;&amp;#x8F7D;2016&amp;#x5E74;&amp;#x7B2C;24&amp;#x671F;&amp;#x300A;&amp;#x8D22;&amp;#x65B0;&amp;#x5468;&amp;#x520A;&amp;#x300B;&amp;#xFF09; 
&amp;#x6211;&amp;#x5728;&amp;#x676D;&amp;#x5DDE;&amp;#x5DE5;&amp;#x4F5C;">
<meta property="og:image" content="http://yoursite.com/2016/09/29/你的命运不是一头骡子/dengzhu.jpg">
<meta property="og:image" content="http://yoursite.com/2016/09/29/你的命运不是一头骡子/bg2016060707.jpg">
<meta property="og:image" content="http://yoursite.com/2016/09/29/你的命运不是一头骡子/bg2016061510.jpg">
<meta property="og:image" content="http://yoursite.com/2016/09/29/你的命运不是一头骡子/bg2016061509.jpg">
<meta property="og:updated_time" content="2017-01-06T16:10:55.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="你的命运不是一头骡子">
<meta name="twitter:description" content="&amp;#xFF08;&amp;#x8BF4;&amp;#x660E;&amp;#xFF1A;&amp;#x672C;&amp;#x6587;&amp;#x539F;&amp;#x8F7D;2016&amp;#x5E74;&amp;#x7B2C;24&amp;#x671F;&amp;#x300A;&amp;#x8D22;&amp;#x65B0;&amp;#x5468;&amp;#x520A;&amp;#x300B;&amp;#xFF09; 
&amp;#x6211;&amp;#x5728;&amp;#x676D;&amp;#x5DDE;&amp;#x5DE5;&amp;#x4F5C;">
<meta name="twitter:image" content="http://yoursite.com/2016/09/29/你的命运不是一头骡子/dengzhu.jpg">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Muse',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '0',
      author: 'Author'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="http://yoursite.com/2016/09/29/你的命运不是一头骡子/"/>





  <title> 你的命运不是一头骡子 | 梁小新blog </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="en">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">梁小新blog</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
    
      <h1 class="site-subtitle" itemprop="description"></h1>
    
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            Home
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            Archives
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            Tags
          </a>
        </li>
      

      
    </ul>
  

  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://yoursite.com/2016/09/29/你的命运不是一头骡子/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="liangxiaoxin">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/images/avatar.gif">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="梁小新blog">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="梁小新blog" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h2 class="post-title" itemprop="name headline">
            
            
              
                你的命运不是一头骡子
              
            
          </h2>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">Posted on</span>
              
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2016-09-29T15:08:43+08:00">
                2016-09-29
              </time>
            

            

            
          </span>

          

          
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p><code>&#xFF08;&#x8BF4;&#x660E;&#xFF1A;&#x672C;&#x6587;&#x539F;&#x8F7D;2016&#x5E74;&#x7B2C;24&#x671F;&#x300A;&#x8D22;&#x65B0;&#x5468;&#x520A;&#x300B;&#xFF09;</code> </p>
<p>&#x6211;&#x5728;&#x676D;&#x5DDE;&#x5DE5;&#x4F5C;&#xFF0C;&#x5468;&#x672B;&#x901A;&#x5E38;&#x53BB;&#x722C;&#x5C71;&#x3002;&#x4ECA;&#x5E74;&#x4E5D;&#x6708;&#xFF0C;&#x8FD9;&#x91CC;&#x5C06;&#x4E3E;&#x529E;&#x76DB;&#x5927;&#x7684;G20&#x5CF0;&#x4F1A;&#x3002;&#x5168;&#x57CE;&#x90FD;&#x5728;&#x5FD9;&#x788C;&#x5730;&#x7B79;&#x5907;&#xFF0C;&#x5C71;&#x8DEF;&#x4E0A;&#x4E5F;&#x4E0D;&#x4F8B;&#x5916;&#x3002;&#x8DDD;&#x79BB;&#x897F;&#x6E56;&#x6700;&#x8FD1;&#x7684;&#x4E00;&#x5708;&#x5C71;&#x5934;&#xFF0C;&#x90FD;&#x5728;&#x5B89;&#x88C5;&#x7167;&#x660E;&#x8BBE;&#x5907;&#xFF0C;&#x51C6;&#x5907;&#x5728;&#x591C;&#x95F4;&#x4EAE;&#x706F;&#x3002; </p>
<p><img src="/2016/09/29/&#x4F60;&#x7684;&#x547D;&#x8FD0;&#x4E0D;&#x662F;&#x4E00;&#x5934;&#x9AA1;&#x5B50;/dengzhu.jpg" alt="&#x5DE5;&#x4EBA;&#x5728;&#x51C6;&#x5907;&#x706F;"> </p>
<p>&#x90A3;&#x4E9B;&#x706F;&#x67F1;&#x90FD;&#x662F;&#x94F8;&#x94C1;&#x505A;&#x7684;&#xFF0C;&#x9AD8;&#x5EA6;&#x516D;&#x4E03;&#x7C73;&#xFF0C;&#x975E;&#x5E38;&#x6C89;&#x91CD;&#x3002;&#x65BD;&#x5DE5;&#x961F;&#x4F7F;&#x7528;&#x9AA1;&#x5B50;&#xFF0C;&#x5C06;&#x706F;&#x67F1;&#x4ECE;&#x5C71;&#x811A;&#x8FD0;&#x5230;&#x5CF0;&#x9876;&#x3002; </p>
<p>&#x6211;&#x5728;&#x5C71;&#x8DEF;&#x4E0A;&#x9047;&#x8FC7;&#x597D;&#x51E0;&#x6B21;&#x9A6E;&#x8FD0;&#x8BBE;&#x5907;&#x7684;&#x9AA1;&#x5B50;&#x3002;&#x5B83;&#x4EEC;&#x80CC;&#x4E0A;&#x4E24;&#x8FB9;&#x5404;&#x7ED1;&#x7740;&#x4E00;&#x6839;&#x6781;&#x91CD;&#x7684;&#x706F;&#x67F1;&#xFF0C;&#x9ED8;&#x9ED8;&#x5730;&#x4F4E;&#x7740;&#x5934;&#xFF0C;&#x8E52;&#x8DDA;&#x5730;&#x8E29;&#x5728;&#x77F3;&#x9636;&#x4E0A;&#x3002;&#x7B49;&#x722C;&#x5230;&#x5CF0;&#x9876;&#xFF0C;&#x5378;&#x4E0B;&#x8BBE;&#x5907;&#x4EE5;&#x540E;&#xFF0C;&#x53C8;&#x8FD4;&#x56DE;&#x5C71;&#x811A;&#xFF0C;&#x9A6E;&#x8FD0;&#x4E0B;&#x4E00;&#x6279;&#x3002;&#x6BCF;&#x5934;&#x9AA1;&#x5B50;&#x7684;&#x5C41;&#x80A1;&#x540E;&#x9762;&#xFF0C;&#x90FD;&#x8DDF;&#x7740;&#x4E00;&#x4E2A;&#x62FF;&#x7740;&#x6728;&#x68CD;&#x3001;&#x770B;&#x7BA1;&#x5B83;&#x7684;&#x65BD;&#x5DE5;&#x4EBA;&#x5458;&#xFF0C;&#x9632;&#x6B62;&#x5B83;&#x8D70;&#x9519;&#x8DEF;&#x3002;</p>
<p>&#x6709;&#x4E00;&#x6B21;&#xFF0C;&#x6211;&#x770B;&#x89C1;&#x4E00;&#x5934;&#x9AA1;&#x5B50;&#x7F13;&#x7F13;&#x8D70;&#x7740;&#xFF0C;&#x7A81;&#x7136;&#x505C;&#x4E0B;&#x6765;&#xFF0C;&#x4F4E;&#x7740;&#x5934;&#x6BEB;&#x65E0;&#x8868;&#x60C5;&#x5730;&#x4E00;&#x52A8;&#x4E0D;&#x52A8;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x662F;&#x7D2F;&#x4E86;&#x8FD8;&#x662F;&#x4E0D;&#x60F3;&#x8D70;&#x4E86;&#x3002;&#x76D1;&#x5DE5;&#x89C1;&#x72B6;&#xFF0C;&#x7ACB;&#x5373;&#x62FF;&#x68CD;&#x5B50;&#x6233;&#x5B83;&#xFF0C;&#x5B83;&#x832B;&#x7136;&#x5730;&#x62AC;&#x8D77;&#x5934;&#xFF0C;&#x53C8;&#x987A;&#x4ECE;&#x5730;&#x7EE7;&#x7EED;&#x5411;&#x524D;&#x8D70;&#x4E86;&#x3002;</p>
<p>&#x770B;&#x5230;&#x8FD9;&#x4E00;&#x5E55;&#xFF0C;&#x6211;&#x975E;&#x5E38;&#x611F;&#x6168;&#x3002;&#x9AA1;&#x5B50;&#x5E76;&#x4E0D;&#x77E5;&#x9053;&#xFF0C;&#x4E3A;&#x4F55;&#x8981;&#x628A;&#x5982;&#x6B64;&#x91CD;&#x7684;&#x94C1;&#x7BA1;&#x80CC;&#x5230;&#x5C71;&#x9876;&#xFF0C;&#x5C31;&#x662F;&#x56E0;&#x4E3A;&#x4E3B;&#x4EBA;&#x8981;&#x6C42;&#x5B83;&#x8FD9;&#x4E48;&#x505A;&#xFF0C;&#x5C31;&#x4EFB;&#x52B3;&#x4EFB;&#x6028;&#x5730;&#x5E72;&#x4E86;&#x3002;&#x54EA;&#x6015;&#x6709;&#x90A3;&#x4E48;&#x4E00;&#x77AC;&#x95F4;&#xFF0C;&#x5B83;&#x7684;&#x5185;&#x5FC3;&#x6709;&#x8FC7;&#x4E00;&#x4E1D;&#x6297;&#x62D2;&#x6216;&#x7591;&#x95EE;&#xFF0C;&#x4E3B;&#x4EBA;&#x4E00;&#x65BD;&#x538B;&#xFF0C;&#x5B83;&#x5C31;&#x4E0D;&#x518D;&#x8FFD;&#x95EE;&#x4E86;&#xFF0C;&#x56DE;&#x5230;&#x6B63;&#x5E38;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x9ED8;&#x9ED8;&#x5730;&#x542C;&#x4EFB;&#x6446;&#x5E03;&#x3002; </p>
<p><img src="/2016/09/29/&#x4F60;&#x7684;&#x547D;&#x8FD0;&#x4E0D;&#x662F;&#x4E00;&#x5934;&#x9AA1;&#x5B50;/bg2016060707.jpg" alt="&#x4F24;&#x5FC3;&#x7684;&#x9AA1;&#x5B50;"> </p>
<p><strong>&#x6211;&#x4ECE;&#x8FD9;&#x5934;&#x9AA1;&#x5B50;&#x8EAB;&#x4E0A;&#xFF0C;&#x60F3;&#x5230;&#x5F88;&#x591A;&#x4EBA;&#x4E0D;&#x4E5F;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x80CC;&#x8D1F;&#x91CD;&#x538B;&#xFF0C;&#x88AB;&#x63A8;&#x7740;&#x524D;&#x884C;&#xFF0C;&#x5374;&#x4E0D;&#x77E5;&#x4E3A;&#x4F55;&#x3002;&#x4ED6;&#x4EEC;&#x57CB;&#x5934;&#x52E4;&#x594B;&#x5DE5;&#x4F5C;&#xFF0C;&#x52AA;&#x529B;&#x5B8C;&#x6210;&#x4E0A;&#x7EA7;&#x4EA4;&#x4ED8;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#xFF0C;&#x522B;&#x4EBA;&#x8BA9;&#x4F60;&#x5E72;&#x4EC0;&#x4E48;&#x5C31;&#x5E72;&#x4EC0;&#x4E48;&#xFF0C;&#x5374;&#x6CA1;&#x6709;&#x601D;&#x8003;&#x8FC7;&#x8FD9;&#x4E00;&#x5207;&#x5230;&#x5E95;&#x4E3A;&#x4E86;&#x4EC0;&#x4E48;&#x3002;</strong> </p>
<p>&#x8BF4;&#x8D77;&#x6765;&#xFF0C;&#x4E2D;&#x56FD;&#x4EBA;&#x4E0E;&#x9AA1;&#x5B50;&#x771F;&#x7684;&#x6709;&#x5F88;&#x591A;&#x76F8;&#x4F3C;&#x6027;&#x3002;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x8BB8;&#x591A;&#x4EBA;&#x80CC;&#x4E0A;&#x7684;&#x751F;&#x6D3B;&#x538B;&#x529B;&#xFF0C;&#x4E0D;&#x4F1A;&#x6BD4;&#x90A3;&#x5934;&#x9AA1;&#x5B50;&#x5C0F;&#x591A;&#x5C11;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5E95;&#x5C42;&#x6C11;&#x4F17;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x4E2D;&#x56FD;&#x4EBA;&#x7684;&#x52E4;&#x52B3;&#x548C;&#x5FCD;&#x8010;&#x80FD;&#x529B;&#xFF0C;&#x66F4;&#x662F;&#x6709;&#x8FC7;&#x4E4B;&#x800C;&#x65E0;&#x4E0D;&#x53CA;&#x3002;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x70B9;&#x662F;&#xFF0C;&#x9AA1;&#x5B50;&#x53EA;&#x80FD;&#x63A5;&#x53D7;&#x73B0;&#x5B9E;&#xFF0C;&#x63A5;&#x53D7;&#x547D;&#x8FD0;&#x7684;&#x5B89;&#x6392;&#xFF0C;&#x4EBA;&#x53C8;&#x4F55;&#x5C1D;&#x4E0D;&#x662F;&#x5982;&#x6B64;&#x5462;&#xFF1F; </p>
<p>&#x4E0D;&#x8FC7;&#xFF0C;&#x9AA1;&#x5B50;&#x662F;&#x786E;&#x5B9E;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#xFF0C;&#x5B83;&#x4E0D;&#x4F1A;&#x601D;&#x8003;&#xFF0C;&#x6CA1;&#x6709;&#x80FD;&#x529B;&#x6297;&#x62D2;&#x547D;&#x8FD0;&#x7684;&#x5B89;&#x6392;&#x3002;&#x4EBA;&#x53EF;&#x4EE5;&#x601D;&#x8003;&#xFF0C;&#x4E5F;&#x6709;&#x884C;&#x52A8;&#x80FD;&#x529B;&#x3002;<code>&#x6211;&#x611F;&#x53F9;&#x7684;&#x662F;&#xFF0C;&#x90A3;&#x4E48;&#x591A;&#x4EBA;&#x5FC3;&#x7518;&#x60C5;&#x613F;&#x5730;&#x653E;&#x5F03;&#xFF0C;&#x8FD9;&#x79CD;&#x53EA;&#x6709;&#x4EBA;&#x7C7B;&#x624D;&#x5177;&#x6709;&#x7684;&#x5929;&#x8D4B;&#xFF0C;&quot;&#x81EA;&#x613F;&quot;&#x50CF;&#x9AA1;&#x5B50;&#x90A3;&#x6837;&#x6D3B;&#x7740;&#xFF0C;&#x8FD8;&#x8BF4;&quot;&#x8FD9;&#x5C31;&#x662F;&#x547D;&#xFF0C;&#x80FD;&#x6709;&#x4EC0;&#x4E48;&#x529E;&#x6CD5;&#x5462;&quot;&#xFF0C;&#x6216;&#x8005;&quot;&#x6211;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x554A;&#xFF0C;&#x9664;&#x4E86;&#x8FD9;&#x4E2A;&#xFF0C;&#x6211;&#x8FD8;&#x80FD;&#x5E72;&#x4EC0;&#x4E48;&quot;&#x3002;</code> </p>
<p><img src="/2016/09/29/&#x4F60;&#x7684;&#x547D;&#x8FD0;&#x4E0D;&#x662F;&#x4E00;&#x5934;&#x9AA1;&#x5B50;/bg2016061510.jpg" alt="&#x4E00;&#x4E2A;&#x4EBA;&#x72EC;&#x81EA;&#x524D;&#x884C;">  </p>
<p>&#x8BFB;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x4F60;&#x4E5F;&#x8BB8;&#x4F1A;&#x8BF4;&#xFF0C;&#x201D;&#x54EA;&#x6709;&#x4F60;&#x8BF4;&#x7684;&#x90A3;&#x4E48;&#x4E25;&#x91CD;&#xFF0C;&#x5DE5;&#x4F5C;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x8D5A;&#x94B1;&#x3002;&#x4EC0;&#x4E48;&#x63A5;&#x53D7;&#x547D;&#x8FD0;&#x7684;&#x6446;&#x5E03;&#x3001;&#x653E;&#x5F03;&#x601D;&#x8003;&#x80FD;&#x529B;&#x3002;&#x4E3A;&#x4E86;&#x591A;&#x8D5A;&#x4E00;&#x70B9;&#x94B1;&#x52AA;&#x529B;&#x5DE5;&#x4F5C;&#xFF0C;&#x4E0D;&#x662F;&#x5F88;&#x5408;&#x7406;&#x5417;&#xFF0C;&#x8DDF;&#x9AA1;&#x5B50;&#x626F;&#x5F97;&#x4E0A;&#x5173;&#x7CFB;&#x5417;&#xFF1F;&#x201D;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x5728;&#x751F;&#x5B58;&#x9762;&#x524D;&#xFF0C;&#x4E00;&#x5207;&#x90FD;&#x662F;&#x5408;&#x7406;&#x7684;&#x3002;&#x9AA1;&#x5B50;&#x4E3A;&#x4E86;&#x751F;&#x5B58;&#xFF0C;&#x5FC5;&#x987B;&#x4FEF;&#x9996;&#x542C;&#x547D;&#x3002;&#x4F46;&#x662F;&#xFF0C;21&#x4E16;&#x7EAA;&#x7684;&#x4E2D;&#x56FD;&#x9752;&#x5E74;&#xFF0C;&#x751F;&#x5B58;&#x672C;&#x8EAB;&#x4F3C;&#x4E4E;&#x5DF2;&#x7ECF;&#x4E0D;&#x662F;&#x95EE;&#x9898;&#x4E86;&#x3002;&#x5728;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x4EA7;&#x80FD;&#x548C;&#x8D44;&#x672C;&#x8FC7;&#x5269;&#x7684;&#x65F6;&#x4EE3;&#xFF0C;&#x9664;&#x4E86;&#x8D5A;&#x94B1;&#x4EE5;&#x5916;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x5E94;&#x8BE5;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x4EBA;&#x751F;&#x505A;&#x4E00;&#x4E9B;&#x8BA4;&#x771F;&#x7684;&#x601D;&#x8003;&#xFF0C;&#x4E0D;&#x8981;&#x8BA9;&#x201D;&#x8D5A;&#x94B1;&#x201D;&#x6210;&#x4E3A;&#x601D;&#x60F3;&#x61D2;&#x60F0;&#x7684;&#x501F;&#x53E3;&#x3002;&#x9000;&#x4E00;&#x6B65;&#x8BF4;&#xFF0C;&#x5C31;&#x7B97;&#x4F60;&#x50CF;&#x9AA1;&#x5B50;&#x90A3;&#x6837;&#x6D3B;&#x7740;&#xFF0C;&#x771F;&#x7684;&#x8D5A;&#x5230;&#x4E86;&#x5F88;&#x591A;&#x94B1;&#xFF0C;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x5C31;&#x6B64;&#x8BA4;&#x5B9A;&#xFF0C;&#x5F53;&#x4E00;&#x5934;&#x9AA1;&#x5B50;&#x662F;&#x6B63;&#x786E;&#x7684;&#x4E8B;&#x60C5;&#xFF1F; </p>
<p>&#x8BF4;&#x5B9E;&#x8BDD;&#xFF0C;&#x6211;&#x4E0D;&#x592A;&#x786E;&#x5B9A;&#x3002;&#x5047;&#x5982;&#x6709;&#x4E00;&#x9053;&#x586B;&#x7A7A;&#x9898;&#xFF0C;&#x201D;&#x5982;&#x679C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x5F69;&#x7968;&#x5934;&#x5956;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;<em>__</em>&#x5462;&#xFF1F;&#x201D;&#xFF0C;&#x5728;&#x4E0B;&#x5212;&#x7EBF;&#x7684;&#x5730;&#x65B9;&#x586B;&#x5165;&#x201D;&#x5F53;&#x4E00;&#x5934;&#x9AA1;&#x5B50;&#x201D;&#xFF0C;&#x4F3C;&#x4E4E;&#x903B;&#x8F91;&#x4E0A;&#x4E5F;&#x8BF4;&#x5F97;&#x8FC7;&#x53BB;&#x3002;&#x4F46;&#x4ECE;&#x5185;&#x5FC3;&#x91CC;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x57FA;&#x4E8E;&#x6211;&#x7684;&#x504F;&#x6267;&#xFF0C;&#x6211;&#x8FD8;&#x662F;&#x8BA4;&#x4E3A;&#x8FD9;&#x6837;&#x662F;&#x4E0D;&#x5BF9;&#x7684;&#x3002; </p>
<p>&#x8BA9;&#x6211;&#x4E3E;&#x4E00;&#x4E2A;&#x5B9E;&#x9645;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x6211;&#x6BD4;&#x8F83;&#x719F;&#x6089;&#x201D;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x5E08;&#x201D;&#x8FD9;&#x4E2A;&#x804C;&#x4E1A;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x804C;&#x4E1A;&#x7A0B;&#x5E8F;&#x5458;&#x3002;&#x5728;&#x6211;&#x770B;&#x6765;&#xFF0C;&#x8FD9;&#x79CD;&#x804C;&#x4E1A;&#x8DDF;&#x9AA1;&#x5B50;&#x6709;&#x5F88;&#x591A;&#x76F8;&#x4F3C;&#x6027;&#xFF0C;&#x5C24;&#x5176;&#x5728;&#x5927;&#x516C;&#x53F8;&#x91CC;&#x3002;&#x56E0;&#x4E3A;&#x5927;&#x516C;&#x53F8;&#x6709;&#x4E25;&#x683C;&#x7684;&#x5206;&#x5DE5;&#xFF0C;&#x8BBE;&#x8BA1;&#x5E08;&#x51FA;&#x89C6;&#x89C9;&#x7A3F;&#xFF0C;&#x4E1A;&#x52A1;&#x90E8;&#x95E8;&#x63D0;&#x51FA;&#x9700;&#x6C42;&#x548C;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#xFF0C;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x8D1F;&#x8D23;&#x9879;&#x76EE;&#x5B9E;&#x65BD;&#xFF0C;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x804C;&#x8D23;&#x5C31;&#x662F;&#x4E25;&#x683C;&#x6309;&#x7167;&#x8BBE;&#x8BA1;&#x7A3F;&#xFF0C;&#x5C06;&#x4EA7;&#x54C1;&#x4E00;&#x6A21;&#x4E00;&#x6837;&#x5730;&#x5B9E;&#x73B0;&#x51FA;&#x6765;&#x3002;&#x672C;&#x8D28;&#x4E0A;&#xFF0C;&#x8FD9;&#x8DDF;&#x9AA1;&#x5B50;&#x80CC;&#x94C1;&#x7BA1;&#x4E0A;&#x5C71;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x533A;&#x522B;&#x3002; </p>
<p>&#x300A;&#x9ED1;&#x5BA2;&#x4E0E;&#x753B;&#x5BB6;&#x300B;&#x7684;&#x4F5C;&#x8005;&#x4FDD;&#x7F57;&#x2022;&#x683C;&#x96F7;&#x5384;&#x59C6;&#xFF0C;&#x505A;&#x8FC7;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x597D;&#x7684;&#x6982;&#x62EC;&#x3002; </p>
<pre><code>&quot;......&#xFF08;&#x4F60;&#xFF09;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x8D1F;&#x8D23;&#x5B9E;&#x73B0;&#x9886;&#x5BFC;&#x610F;&#x5FD7;&#x7684;&#x6280;&#x672F;&#x5DE5;&#x4EBA;&#xFF0C;&#x804C;&#x8D23;&#x5C31;&#x662F;&#x6839;&#x636E;&#x89C4;&#x683C;&#x8BF4;&#x660E;&#x4E66;&#x5199;&#x51FA;&#x4EE3;&#x7801;&#xFF0C;&#x5176;&#x5B9E;&#x4E0E;&#x4E00;&#x4E2A;&#x6316;&#x6C34;&#x6C9F;&#x7684;&#x5DE5;&#x4EBA;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x4ECE;&#x8FD9;&#x5934;&#x6316;&#x5230;&#x90A3;&#x5934;&#xFF0C;&#x4EC5;&#x6B64;&#x800C;&#x5DF2;&#xFF0C;&#x4ECE;&#x4E8B;&#x7684;&#x90FD;&#x662F;&#x673A;&#x68B0;&#x6027;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&quot; 
</code></pre><p>&#x6211;&#x4E0D;&#x662F;&#x8BF4;&#x8FD9;&#x6837;&#x7684;&#x6D41;&#x7A0B;&#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x5BF9;&#xFF0C;&#x800C;&#x662F;&#x8BF4;&#x5728;&#x8FD9;&#x4E2A;&#x6D41;&#x7A0B;&#x91CC;&#xFF0C;&#x4EBA;&#x53EA;&#x662F;&#x5145;&#x5F53;&#x4E00;&#x79CD;&#x5DE5;&#x5177;&#x3002;&#x5C31;&#x50CF;&#x9AA1;&#x5B50;&#x53EA;&#x662F;&#x94C1;&#x7BA1;&#x4E0A;&#x5C71;&#x7684;&#x4E00;&#x79CD;&#x624B;&#x6BB5;&#xFF0C;&#x4F60;&#x53EA;&#x662F;&#x4EA7;&#x51FA;&#x4EE3;&#x7801;&#x7684;&#x4E00;&#x79CD;&#x624B;&#x6BB5;&#xFF0C;&#x672C;&#x8EAB;&#x5E76;&#x6CA1;&#x6709;&#x201D;&#x81EA;&#x7531;&#x610F;&#x5FD7;&#x201D;&#x4F53;&#x73B0;&#x5728;&#x91CC;&#x9762;&#x3002;&#x6216;&#x8005;&#x8BF4;&#xFF0C;&#x4F60;&#x8EAB;&#x4E0A;&#x4F53;&#x73B0;&#x7684;&#x90FD;&#x662F;&#x4ED6;&#x4EBA;&#x7684;&#xFF08;&#x6216;&#x8D44;&#x672C;&#x7684;&#xFF09;&#x610F;&#x5FD7;&#xFF0C;&#x4F60;&#x65E0;&#x6CD5;&#x8868;&#x73B0;&#x51FA;&#x81EA;&#x6211;&#x3002;&#x8BC4;&#x4EF7;&#x9AA1;&#x5B50;&#x7684;&#x6807;&#x51C6;&#x662F;&#xFF0C;&#x94C1;&#x7BA1;&#x80CC;&#x5F97;&#x6BD4;&#x8F83;&#x591A;&#x3001;&#x6BD4;&#x8F83;&#x5FEB;&#xFF0C;&#x8BC4;&#x4EF7;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x6807;&#x51C6;&#x53C8;&#x4F55;&#x5C1D;&#x4E0D;&#x662F;&#x5982;&#x6B64;&#x5462;&#xFF0C;&#x90FD;&#x662F;&#x770B;&#x662F;&#x5426;&#x5FE0;&#x5B9E;&#x6709;&#x6548;&#x5730;&#x5B9E;&#x73B0;&#x90A3;&#x4E9B;&#x5916;&#x90E8;&#x610F;&#x5FD7;&#x3002; </p>
<p>&#x6211;&#x89C1;&#x8FC7;&#x8BB8;&#x591A;&#x5E74;&#x8F7B;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x52E4;&#x594B;&#x5DE5;&#x4F5C;&#xFF0C;&#x4ECE;&#x65E9;&#x5230;&#x665A;&#x4E00;&#x523B;&#x4E0D;&#x505C;&#x5730;&#x7F16;&#x7801;&#xFF0C;&#x5468;&#x672B;&#x4E5F;&#x6765;&#x52A0;&#x73ED;&#xFF0C;&#x52AA;&#x529B;&#x5B8C;&#x6210;&#x516C;&#x53F8;&#x7684;&#x4E00;&#x4E2A;&#x4E2A;&#x76EE;&#x6807;&#xFF0C;&#x4ECE;&#x6765;&#x4E0D;&#x95EE;&#x3001;&#x751A;&#x81F3;&#x4E0D;&#x60F3;&#x201D;&#x8FD9;&#x79CD;&#x9700;&#x6C42;&#x5BF9;&#x4E0D;&#x5BF9;&#x201D;&#x3001;&#x201D;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x6709;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x201D;&#xFF0C;&#x66F4;&#x4E0D;&#x8981;&#x8BF4;&#x60F3;&#x4E00;&#x60F3;&#x201D;&#x6211;&#x7684;&#x4EBA;&#x751F;&#x89C4;&#x5212;&#x662F;&#x4EC0;&#x4E48;&#x201D;&#x3002;&#x4E2D;&#x56FD;&#x7684;&#x73B0;&#x5B9E;&#x4E5F;&#x5F88;&#x6B8B;&#x9177;&#xFF0C;&#x516C;&#x53F8;&#x7684;&#x54F2;&#x5B66;&#x5C31;&#x662F;&#x544A;&#x8BC9;&#x4F60;&#x505A;&#x4EC0;&#x4E48;&#xFF0C;&#x4F60;&#x5C31;&#x505A;&#x4EC0;&#x4E48;&#xFF0C;&#x4E0D;&#x60F3;&#x505A;&#x5C31;&#x79BB;&#x5F00;&#x3002; </p>
<p><img src="/2016/09/29/&#x4F60;&#x7684;&#x547D;&#x8FD0;&#x4E0D;&#x662F;&#x4E00;&#x5934;&#x9AA1;&#x5B50;/bg2016061509.jpg" alt="&#x5C71;"> </p>
<p>&#x6211;&#x53EF;&#x4EE5;&#x60F3;&#x8C61;&#xFF0C;&#x7B49;&#x5230;&#x4E5D;&#x6708;&#x76DB;&#x4F1A;&#x53EC;&#x5F00;&#x65F6;&#xFF0C;&#x5DE5;&#x7A0B;&#x5B8C;&#x6210;&#xFF0C;&#x5C71;&#x5934;&#x4EAE;&#x8D77;&#x706F;&#x5149;&#xFF0C;&#x4E0E;&#x660E;&#x6708;&#x5171;&#x540C;&#x7167;&#x6620;&#x5C71;&#x811A;&#x4E0B;&#x7684;&#x897F;&#x6E56;&#xFF0C;&#x5E73;&#x6E56;&#x5982;&#x955C;&#xFF0C;&#x6E38;&#x4EBA;&#x6CDB;&#x821F;&#xFF0C;&#x590F;&#x591C;&#x51C9;&#x98CE;&#x5439;&#x62C2;&#xFF0C;&#x4F55;&#x7B49;&#x7684;&#x7F8E;&#x666F;&#x7F8E;&#x4E8B;&#x3002;&#x9AA1;&#x5B50;&#x53C2;&#x4E0E;&#x4E86;&#x8FD9;&#x4E00;&#x5207;&#x7684;&#x521B;&#x9020;&#x8FC7;&#x7A0B;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x8C01;&#x4F1A;&#x8BB0;&#x5F97;&#x5B83;&#x4EEC;&#x5462;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x5BBF;&#x547D;&#x5C31;&#x662F;&#x63A5;&#x7740;&#x53BB;&#x4E0B;&#x4E00;&#x4E2A;&#x5DE5;&#x7A0B;&#x80CC;&#x94C1;&#x7BA1;&#x3002; </p>
<p>&#x9AA1;&#x5B50;&#x53EA;&#x662F;&#x65BD;&#x5DE5;&#x961F;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x8DDF;&#x9504;&#x5934;&#x6216;&#x8005;&#x6241;&#x62C5;&#x6CA1;&#x6709;&#x672C;&#x8D28;&#x533A;&#x522B;&#x3002;&#x4F46;&#x4F60;&#x4E0D;&#x662F;&#x4ED6;&#x4EBA;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x4F60;&#x6D3B;&#x7740;&#x4E0D;&#x662F;&#x4E3A;&#x4E86;&#x88AB;&#x52A8;&#x5730;&#x88AB;&#x4ED6;&#x4EBA;&#x4F7F;&#x7528;&#xFF0C;&#x800C;&#x662F;&#x5E94;&#x8BE5;&#x8981;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x4EF7;&#x503C;&#x3002;&#x6211;&#x89C9;&#x5F97;&#xFF0C;&#x4EBA;&#x5E94;&#x8BE5;&#x8FC7;&#x4E00;&#x79CD;&#x6709;&#x4E50;&#x8DA3;&#x3001;&#x6709;&#x8FFD;&#x6C42;&#x3001;&#x81EA;&#x5DF1;&#x505A;&#x4E3B;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x800C;&#x4E0D;&#x80FD;&#x50CF;&#x9AA1;&#x5B50;&#x90A3;&#x6837;&#x88AB;&#x63A8;&#x7740;&#x8D70;&#x3002;</p>
<p><code>&#xFF08;&#x5B8C;&#xFF09;</code></p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>


    <footer class="post-footer">
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/09/27/收集优秀前端网站and博客/" rel="next" title="收集优秀前端网站and博客">
                <i class="fa fa-chevron-left"></i> 收集优秀前端网站and博客
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/10/26/分享一些前端开发中常用的JS代码片段/" rel="prev" title="分享一些前端开发中常用的JS代码片段">
                分享一些前端开发中常用的JS代码片段 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>

          
          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      

      <section class="site-overview sidebar-panel sidebar-panel-active">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/avatar.gif"
               alt="liangxiaoxin" />
          <p class="site-author-name" itemprop="name">liangxiaoxin</p>
          <p class="site-description motion-element" itemprop="description"></p>
        </div>
        <nav class="site-state motion-element">
        
          
            <div class="site-state-item site-state-posts">
              <a href="/archives">
                <span class="site-state-item-count">9</span>
                <span class="site-state-item-name">posts</span>
              </a>
            </div>
          

          

          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

        


      </section>

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">liangxiaoxin</span>
</div>


<div class="powered-by">
  Powered by <a class="theme-link" href="https://hexo.io">Hexo</a>
</div>

<div class="theme-info">
  Theme -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Muse
  </a>
</div>


        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  




  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.0"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.0"></script>



  



  




	





  





  

  
      <!-- UY BEGIN -->
      <script type="text/javascript" src="http://v2.uyan.cc/code/uyan.js?uid="></script>
      <!-- UY END -->
  




  
  

  

  

  

  


</body>
</html>
